In [2]:
import pandas as pd
import numpy as np

In [3]:
dataset = pd.read_csv("Placement.csv")
dataset.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

In [11]:
# find how many nan values are there in each column
dataset.isna().sum()
# fill is nan values with mean of that column
dataset['salary'].fillna(dataset['salary'].mean(), inplace=True)

/var/folders/h3/4zbm2_gs3kvcp1xbhzzbl3zh0000gp/T/ipykernel_12701/2167454479.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset['salary'].fillna(dataset['salary'].mean(), inplace=True)

In [ ]:
## to find the percentile of a particular column
np.percentile(dataset['salary'], 75)  # 75th percentile -- this mean 75% of data lies below this value 288655 range

np.float64(288655.4054054054)

In [ ]:
dataset.describe()
75/100*(215+1) ; # finding percentile position using manual formula K/100*(N+1)

162.0

In [22]:
from Univariate import Univariate

quant, qual = Univariate(dataset).quanQual()

print(quant)
print(qual)

['sl_no', 'ssc_p', 'hsc_p', 'degree_p', 'etest_p', 'mba_p', 'salary']
['gender', 'ssc_b', 'hsc_b', 'hsc_s', 'degree_t', 'workex', 'specialisation', 'status']

In [23]:
dataset.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,77457.900102
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,250000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,288655.405405
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,288655.405405
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

In [28]:
descriptive = pd.DataFrame(index=["Mean","Median", "Mode", "Q1-25%", "Q2-50%", "Q3-75%","99%","Q4-100%"], columns=quant)
for column in descriptive.columns:
    descriptive.loc["Mean", column] = dataset[column].mean()
    descriptive.loc["Median", column] = dataset[column].median()
    descriptive.loc["Mode", column] = dataset[column].mode()[0]
    descriptive.loc["Q1-25%", column] = dataset[column].quantile(0.25)
    descriptive.loc["Q2-50%", column] = dataset[column].quantile(0.50)
    descriptive.loc["Q3-75%", column] = dataset[column].quantile(0.75)
    descriptive.loc["99%", column] = dataset[column].quantile(0.99)
    descriptive.loc["Q4-100%", column] = dataset[column].quantile(1.00)

descriptive

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
Mean,108.0,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
Median,108.0,67.0,65.0,66.0,71.0,62.0,288655.405405
Mode,1,62.0,63.0,65.0,60.0,56.7,288655.405405
Q1-25%,54.5,60.6,60.9,61.0,60.0,57.945,250000.0
Q2-50%,108.0,67.0,65.0,66.0,71.0,62.0,288655.405405
Q3-75%,161.5,75.7,73.0,72.0,83.5,66.255,288655.405405
99%,212.86,87.0,91.86,83.86,97.0,76.1142,629000.0
Q4-100%,215.0,89.4,97.7,91.0,98.0,77.89,940000.0